
## Apply Result

[CI link](https://github.com/mizzy/sakura-cloud-education-touch-demo/actions/runs/1512283059)

It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
aws_vpc.ecs_sample: Refreshing state... [id=vpc-05fa6437d1950b505]
aws_route_table.public: Refreshing state... [id=rtb-02b3748a419fb2683]
aws_route_table.private0: Refreshing state... [id=rtb-04c52d0c2f4f6fb3e]
aws_subnet.private1: Refreshing state... [id=subnet-0b80416f81081f9d5]
aws_subnet.private0: Refreshing state... [id=subnet-0360de0228650800c]
aws_subnet.public0: Refreshing state... [id=subnet-02d54a30d5f61210a]
aws_internet_gateway.igw: Refreshing state... [id=igw-0e1685b83df866267]
aws_subnet.public1: Refreshing state... [id=subnet-0e4d908c8b6012cf4]
aws_route_table.private1: Refreshing state... [id=rtb-0eed5c91cda4b3acc]
aws_eip.ngw0: Refreshing state... [id=eipalloc-04e367929021a68b1]
aws_eip.ngw1: Refreshing state... [id=eipalloc-0db2eac64498abb7a]
aws_route_table_association.private0: Refreshing state... [id=rtbassoc-0104951db21990e4a]
aws_route.public: Refreshing state... [id=r-rtb-02b3748a419fb26831080289494]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0b0139d2ccca64f23]
aws_route_table_association.public0: Refreshing state... [id=rtbassoc-00ef7c2460170cd58]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-03c410620e7b366e5]
aws_nat_gateway.ngw1: Refreshing state... [id=nat-0a57b2a380445c52a]
aws_nat_gateway.ngw0: Refreshing state... [id=nat-07c363cea9ebe7c20]
aws_route.private1: Refreshing state... [id=r-rtb-0eed5c91cda4b3acc1080289494]
aws_route.private0: Refreshing state... [id=r-rtb-04c52d0c2f4f6fb3e1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_subnet.public0 has been changed
  ~ resource "aws_subnet" "public0" {
        id                              = "subnet-02d54a30d5f61210a"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_nat_gateway.ngw0 has been changed
  ~ resource "aws_nat_gateway" "ngw0" {
        id                   = "nat-07c363cea9ebe7c20"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }
  # aws_subnet.private0 has been changed
  ~ resource "aws_subnet" "private0" {
        id                              = "subnet-0360de0228650800c"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_internet_gateway.igw has been changed
  ~ resource "aws_internet_gateway" "igw" {
        id       = "igw-0e1685b83df866267"
      + tags     = {}
        # (4 unchanged attributes hidden)
    }
  # aws_route_table.public has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02b3748a419fb2683"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0e1685b83df866267"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {}
        # (5 unchanged attributes hidden)
    }
  # aws_eip.ngw1 has been changed
  ~ resource "aws_eip" "ngw1" {
      + association_id       = "eipassoc-07ad6baca5a462cb6"
        id                   = "eipalloc-0db2eac64498abb7a"
      + network_interface    = "eni-0d33c27b917dd1705"
      + private_dns          = "ip-10-0-1-182.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.1.182"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }
  # aws_eip.ngw0 has been changed
  ~ resource "aws_eip" "ngw0" {
      + association_id       = "eipassoc-0064d59498328e698"
        id                   = "eipalloc-04e367929021a68b1"
      + network_interface    = "eni-07772136f5edf8491"
      + private_dns          = "ip-10-0-0-36.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.0.36"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }
  # aws_subnet.public1 has been changed
  ~ resource "aws_subnet" "public1" {
        id                              = "subnet-0e4d908c8b6012cf4"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_route_table.private1 has been changed
  ~ resource "aws_route_table" "private1" {
        id               = "rtb-0eed5c91cda4b3acc"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0a57b2a380445c52a"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {}
        # (5 unchanged attributes hidden)
    }
  # aws_subnet.private1 has been changed
  ~ resource "aws_subnet" "private1" {
        id                              = "subnet-0b80416f81081f9d5"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_nat_gateway.ngw1 has been changed
  ~ resource "aws_nat_gateway" "ngw1" {
        id                   = "nat-0a57b2a380445c52a"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }
  # aws_route_table.private0 has been changed
  ~ resource "aws_route_table" "private0" {
        id               = "rtb-04c52d0c2f4f6fb3e"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-07c363cea9ebe7c20"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {}
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.alb_log will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_log"  {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "582318560864",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.sample will be created
  + resource "aws_acm_certificate" "sample" {
      + arn                       = (known after apply)
      + domain_name               = "sakura-cloud-education-touch-demo.com"
      + domain_validation_options = [
          + {
              + domain_name           = "sakura-cloud-education-touch-demo.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.sample will be created
  + resource "aws_acm_certificate_validation" "sample" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb.sample will be created
  + resource "aws_lb" "sample" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "sample"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-02d54a30d5f61210a",
          + "subnet-0e4d908c8b6012cf4",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb-logs"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.sample will be created
  + resource "aws_lb_listener_rule" "sample" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # aws_lb_target_group.sample will be created
  + resource "aws_lb_target_group" "sample" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "sample"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-05fa6437d1950b505"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route53_record.sample will be created
  + resource "aws_route53_record" "sample" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sakura-cloud-education-touch-demo.com"
      + type            = "A"
      + zone_id         = "Z07054061YZ4SIOQH4B64"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.sample_cert_validation will be created
  + resource "aws_route53_record" "sample_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07054061YZ4SIOQH4B64"
    }

  # aws_s3_bucket.alb_log will be created
  + resource "aws_s3_bucket" "alb_log" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "alb-log-of-ecs-sample"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 180
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_policy.alb_log will be created
  + resource "aws_s3_bucket_policy" "alb_log" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.http_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05fa6437d1950b505"
    }

  # module.http_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.https_redirect_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http-redirect-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05fa6437d1950b505"
    }

  # module.https_redirect_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.https_redirect_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.https_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "https-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05fa6437d1950b505"
    }

  # module.https_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.https_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name = (known after apply)
  + domain_name  = "sakura-cloud-education-touch-demo.com"
module.https_sg.aws_security_group.default: Creating...
module.http_sg.aws_security_group.default: Creating...
aws_s3_bucket.alb_log: Creating...
module.https_redirect_sg.aws_security_group.default: Creating...
module.http_sg.aws_security_group.default: Creation complete after 5s [id=sg-0be58c4f1a48c6129]
module.http_sg.aws_security_group_rule.egress: Creating...
module.http_sg.aws_security_group_rule.ingress: Creating...
module.https_redirect_sg.aws_security_group.default: Creation complete after 5s [id=sg-0811d352871ab950e]
module.https_sg.aws_security_group.default: Creation complete after 5s [id=sg-0d03c39c130171a25]
module.https_redirect_sg.aws_security_group_rule.ingress: Creating...
module.https_redirect_sg.aws_security_group_rule.egress: Creating...
module.https_sg.aws_security_group_rule.ingress: Creating...
module.https_sg.aws_security_group_rule.egress: Creating...
module.https_sg.aws_security_group_rule.ingress: Creation complete after 2s [id=sgrule-1132770594]
module.https_redirect_sg.aws_security_group_rule.ingress: Creation complete after 2s [id=sgrule-2663386237]
module.http_sg.aws_security_group_rule.egress: Creation complete after 2s [id=sgrule-4215454654]
module.https_sg.aws_security_group_rule.egress: Creation complete after 4s [id=sgrule-701884444]
module.http_sg.aws_security_group_rule.ingress: Creation complete after 5s [id=sgrule-1740198367]
module.https_redirect_sg.aws_security_group_rule.egress: Creation complete after 5s [id=sgrule-1723817718]
aws_s3_bucket.alb_log: Still creating... [10s elapsed]
aws_s3_bucket.alb_log: Creation complete after 13s [id=alb-log-of-ecs-sample]
data.aws_iam_policy_document.alb_log: Reading...
data.aws_iam_policy_document.alb_log: Read complete after 0s [id=2627642681]
aws_lb.sample: Creating...
aws_s3_bucket_policy.alb_log: Creating...
aws_s3_bucket_policy.alb_log: Creation complete after 1s [id=alb-log-of-ecs-sample]
aws_lb.sample: Still creating... [10s elapsed]
aws_lb.sample: Still creating... [20s elapsed]
aws_lb.sample: Still creating... [30s elapsed]
aws_lb.sample: Still creating... [40s elapsed]
aws_lb.sample: Still creating... [50s elapsed]
aws_lb.sample: Still creating... [1m0s elapsed]
aws_lb.sample: Still creating... [1m10s elapsed]
aws_lb.sample: Still creating... [1m20s elapsed]
aws_lb.sample: Still creating... [1m30s elapsed]
aws_lb.sample: Still creating... [1m40s elapsed]
aws_lb.sample: Still creating... [1m50s elapsed]
aws_lb.sample: Still creating... [2m0s elapsed]
aws_lb.sample: Still creating... [2m10s elapsed]
aws_lb.sample: Still creating... [2m20s elapsed]
aws_lb.sample: Creation complete after 2m21s [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967]
aws_route53_record.sample: Creating...
aws_lb_target_group.sample: Creating...
aws_lb_target_group.sample: Creation complete after 4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94]
aws_route53_record.sample: Still creating... [10s elapsed]
aws_route53_record.sample: Still creating... [20s elapsed]
aws_route53_record.sample: Still creating... [30s elapsed]
aws_route53_record.sample: Creation complete after 31s [id=Z07054061YZ4SIOQH4B64_sakura-cloud-education-touch-demo.com_A]
aws_acm_certificate.sample: Creating...
aws_acm_certificate.sample: Creation complete after 9s [id=arn:aws:acm:ap-northeast-1:722557045766:certificate/697fc502-eafd-4545-9c78-5a56899f47bd]
aws_route53_record.sample_cert_validation: Creating...
aws_lb_listener.https: Creating...
aws_route53_record.sample_cert_validation: Still creating... [10s elapsed]
aws_route53_record.sample_cert_validation: Still creating... [20s elapsed]
aws_route53_record.sample_cert_validation: Still creating... [30s elapsed]
aws_route53_record.sample_cert_validation: Creation complete after 39s [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME]
aws_acm_certificate_validation.sample: Creating...
aws_acm_certificate_validation.sample: Creation complete after 2s [id=2021-11-28 08:47:09 +0000 UTC]
╷
│ Error: error creating ELBv2 Listener (arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967): UnsupportedCertificate: The certificate 'arn:aws:acm:ap-northeast-1:722557045766:certificate/697fc502-eafd-4545-9c78-5a56899f47bd' must have a fully-qualified domain name, a supported signature, and a supported key size.
│ 	status code: 400, request id: f440cf34-7726-43cc-b83a-fa0d2664d7fa
│ 
│   with aws_lb_listener.https,
│   on lb.tf line 80, in resource "aws_lb_listener" "https":
│   80: resource "aws_lb_listener" "https" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"84fbadec1433773747f723b5f3ecf9fa8151b57b","Vars":{},"WorkflowName":"terraform"} -->